app/views/trips/index.html.erb

		<% else %>
			<% trip.arrangement_for(current_person).passengers.each do |passenger| %>
---
SELECT "arrangements".* FROM "arrangements" WHERE ("arrangements".trip_id = 1)