app/views/devise/registrations/edit.html.erb

SELECT "vehicles".* FROM "vehicles" WHERE ("vehicles".owner_id = 1)
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "vehicles" WHERE ("vehicles".owner_id = 1)) AS subquery
---

<% if resource.vehicles.count > 0 %>