app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips" WHERE ("trips"."id" = 1) LIMIT 1
---
  def show
    @trip = Trip.find(params[:id])

SELECT "trips".* FROM "trips" WHERE ("trips"."id" = 1) LIMIT 1
---
  def edit
    @trip = Trip.find(params[:id])

INSERT INTO "trips" ("address", "city", "created_at", "name", "organizer_id", "state", "time", "updated_at") VALUES ('24 main st', 'berkeley', '2010-11-02 02:46:35.154683', 'epic', 4, 'ca', '2010-11-02 02:45:00.000000', '2010-11-02 02:46:35.154683')
---
  def create
    logger.info("params:")
    logger.info(params[:trip].inspect)
    @trip = Trip.new(params[:trip])
    @trip.participants << current_person

SELECT "trips".* FROM "trips" WHERE ("trips"."id" = 1) LIMIT 1
UPDATE "trips" SET "time" = '2010-12-02 02:45:00.000000', "updated_at" = '2010-11-02 02:48:09.433911' WHERE ("trips"."id" = 1)
---
  def update
    @trip = Trip.find(params[:id])

    respond_to do |format|
      if @trip.update_attributes(params[:trip])