app/controllers/trips_controller.rb

  def index
    @trips = (current_person.trips | current_person.organized_trips).sort {|x, y| x.time <=> y.time}.reverse
    unless params[:month].nil? || params[:year].nil?
      @trips = @trips.select {|t| t.time.month == params[:month].to_i && t.time.year == params[:year].to_i}
---
SELECT "trips".* FROM "trips" WHERE (organizer_id = 3)