app/controllers/vehicles_controller.rb

INSERT INTO "vehicles" ("capacity", "created_at", "make", "model", "owner_id", "updated_at") VALUES (1, '2010-11-02 01:33:55.119044', 'Test', 'Test', 1, '2010-11-02 01:33:55.119044')
---
  def create
    @vehicle = current_person.vehicles.build(params[:vehicle])
    @redirect = params[:redirect]

    if @vehicle.save